archive/before-2018-11-10/2016-10-08-dd-introduction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>介绍一个古老的工具dd</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="pengpengxp" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">介绍一个古老的工具dd</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org45a4d17">1. dd是什么</a></li>
<li><a href="#orgc5a9d4c">2. dd可以做什么</a></li>
<li><a href="#org72aaa98">3. 使用dd制作linux启动U盘</a></li>
<li><a href="#win">4. 使用dd制作windows启动盘</a></li>
<li><a href="#org69793fd">5. 备份操作系统</a></li>
<li><a href="#org1e11ba8">6. <span class="todo TODO">TODO</span> 加速备份 （这个方法我还没有试过）</a></li>
<li><a href="#org1da23b6">7. 直接安装操作系统</a></li>
<li><a href="#org40c466d">8. MISC</a></li>
</ul>
</div>
</div>

<div id="outline-container-org45a4d17" class="outline-2">
<h2 id="org45a4d17"><span class="section-number-2">1</span> dd是什么</h2>
<div class="outline-text-2" id="text-1">
<p>
dd是一个古老的命令，Wikipedia上这样解释：
</p>
<pre class="example">
dd是一个Unix和类Unix系统上的命令，主要功能为转换和复制文件。
</pre>
</div>
</div>

<div id="outline-container-orgc5a9d4c" class="outline-2">
<h2 id="orgc5a9d4c"><span class="section-number-2">2</span> dd可以做什么</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>制做启动U盘</li>
<li>备份系统</li>
<li>直接安装系统</li>
</ul>
</div>
</div>

<div id="outline-container-org72aaa98" class="outline-2">
<h2 id="org72aaa98"><span class="section-number-2">3</span> 使用dd制作linux启动U盘</h2>
<div class="outline-text-2" id="text-3">
<p>
假设对应的镜像文件放在 <code>/mnt/linux.iso</code> ，U盘为 <code>/dev/sdb</code> ，一条命令就可以搞定：
</p>
<div class="org-src-container">
<pre class="src src-sh">    sudo dd <span style="color: #ff8700;">if</span>=/mnt/linux.iso <span style="color: #ff8700;">of</span>=/dev/sdb
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea8e3a1" class="outline-2">
<h2 id="win"><a id="orgea8e3a1"></a><span class="section-number-2">4</span> 使用dd制作windows启动盘</h2>
<div class="outline-text-2" id="text-win">
<p>
假设对应的镜像文件放在 <code>/mnt/win7.iso</code> ，U盘为 <code>/dev/sdb</code> 。
</p>

<ul class="org-ul">
<li><p>
使用fdisk给U盘分区，需要把partition type改为7并打上bootable标志。
</p>
<pre class="example">
      openstack@object2:~$ sudo fdisk /dev/sdb
      [sudo] password for openstack: 

      Welcome to fdisk (util-linux 2.27.1).
      Changes will remain in memory only, until you decide to write them.
      Be careful before using the write command.

      Command (m for help): p
      Disk /dev/sdb: 3.7 GiB, 4002910208 bytes, 7818184 sectors
      Units: sectors of 1 * 512 = 512 bytes
      Sector size (logical/physical): 512 bytes / 512 bytes
      I/O size (minimum/optimal): 512 bytes / 512 bytes
      Disklabel type: dos
      Disk identifier: 0x4187fea2

      Command (m for help): n
      Partition type
         p   primary (0 primary, 0 extended, 4 free)
         e   extended (container for logical partitions)
      Select (default p): 

      Using default response p.
      Partition number (1-4, default 1): 
      First sector (2048-7818183, default 2048): 
      Last sector, +sectors or +size{K,M,G,T,P} (2048-7818183, default 7818183): 

      Created a new partition 1 of type 'Linux' and of size 3.7 GiB.

      Command (m for help): p
      Disk /dev/sdb: 3.7 GiB, 4002910208 bytes, 7818184 sectors
      Units: sectors of 1 * 512 = 512 bytes
      Sector size (logical/physical): 512 bytes / 512 bytes
      I/O size (minimum/optimal): 512 bytes / 512 bytes
      Disklabel type: dos
      Disk identifier: 0x4187fea2

      Device     Boot Start     End Sectors  Size Id Type
      /dev/sdb1        2048 7818183 7816136  3.7G 83 Linux

      Command (m for help): t
      Selected partition 1
      Partition type (type L to list all types): 7
      Changed type of partition 'Linux' to 'HPFS/NTFS/exFAT'.

      Command (m for help): a
      Selected partition 1
      The bootable flag on partition 1 is enabled now.

      Command (m for help): p
      Disk /dev/sdb: 3.7 GiB, 4002910208 bytes, 7818184 sectors
      Units: sectors of 1 * 512 = 512 bytes
      Sector size (logical/physical): 512 bytes / 512 bytes
      I/O size (minimum/optimal): 512 bytes / 512 bytes
      Disklabel type: dos
      Disk identifier: 0x4187fea2

      Device     Boot Start     End Sectors  Size Id Type
      /dev/sdb1  *     2048 7818183 7816136  3.7G  7 HPFS/NTFS/exFAT

      Command (m for help): 
</pre></li>
<li><p>
创建文件系统
</p>
<pre class="example">
      mkfs.ntfs -f /dev/sdb1
</pre></li>
<li><p>
使用dd先把mbr写入<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>：
</p>
<pre class="example">
      dd if=/usr/lib/syslinux/bios/mbr.bin of=/dev/sdb 
</pre></li>
<li><p>
最后把win7的iso挂载上，将其中的内容全部拷贝到制作好的分驱中就行了：
</p>
<pre class="example">
      sudo mkdir /mnt/iso /mnt/usb
      sudo mount -o loop /mnt/win7.iso /mnt/iso
      sudo mount /dev/sdb1 /mnt/usb
      sudo cp -r /mnt/iso/* /mnt/usb/
</pre></li>
</ul>

<p>
这样就制作好了一个win7的启动U盘<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>。
</p>
</div>
</div>

<div id="outline-container-org69793fd" class="outline-2">
<h2 id="org69793fd"><span class="section-number-2">5</span> 备份操作系统<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup></h2>
<div class="outline-text-2" id="text-5">
<p>
备份前面<a href="#win">4</a>制作好的启动盘：
</p>
<div class="org-src-container">
<pre class="src src-sh">     dd <span style="color: #ff8700;">if</span>=/dev/sdb <span style="color: #ff8700;">of</span>=/tmp/win7.img
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e11ba8" class="outline-2">
<h2 id="org1e11ba8"><span class="section-number-2">6</span> <span class="todo TODO">TODO</span> 加速备份 （这个方法我还没有试过）</h2>
<div class="outline-text-2" id="text-6">
<p>
我需要备份我的系统盘，整个盘有120G，如果完整备份的话，就一定需要120G
的空间才行。可以通过下面这样的来压缩一下，恢复时解压再恢复：
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">To save space, you can compress data produced by dd with gzip, e.g.:</span>
dd <span style="color: #ff8700;">if</span>=/dev/hdb | gzip -c  &gt; /image.img

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">You can restore your disk with:</span>

gunzip -c /image.img.gz | dd <span style="color: #ff8700;">of</span>=/dev/hdb
</pre>
</div>
<p>
这样应该占用的空间可以少一些。
</p>

<p>
更进一步，可以把需要备份磁盘上没有使用的空间都完全写为 <code>0</code> 。然后使
用 gzip压缩效果就很好，进行一下如下操作：
</p>
<div class="org-src-container">
<pre class="src src-sh">mkdir /mnt/hdb
mount /dev/hdb /mnt/hdb
dd <span style="color: #ff8700;">if</span>=/dev/zero <span style="color: #ff8700;">of</span>=/mnt/hdb/zero

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Wait a bit, dd will eventually fail with a "disk full" message,</span>
<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">then:</span>

rm /mnt/hdb/zero
umount /mnt/hdb
dd <span style="color: #ff8700;">if</span>=/dev/hdb | gzip -c  &gt; /image.img
</pre>
</div>
<p>
我理解就是使用 <code>dd</code> ，把对应磁盘没有使用的空间都用0（也就是
<code>/dev/zero</code> ）填满。生成的这个 <code>zero</code> 文件应该全都是0。然后再删掉，
磁盘未使用空间都是0啦。这个时候使用gzip来压缩效果应该是非常好的。
</p>
</div>
</div>

<div id="outline-container-org1da23b6" class="outline-2">
<h2 id="org1da23b6"><span class="section-number-2">7</span> 直接安装操作系统</h2>
<div class="outline-text-2" id="text-7">
<p>
想像一下在黑客们直接使用网线连接两台电脑后安装操作系统的画面 :) 。可
以使用dd来完成。基本思路是这样的：
</p>

<ul class="org-ul">
<li>首先制作好对应的img文件。可以在virtualbox等虚拟机中把系统安装配置
好。</li>
<li>使用livecd进去把/dev/sda整个dd出来做成一个img。</li>
<li><p>
使用livecd启动需要安装系统的机器，然后把img再dd去/dev/sda里面去就
可以了。
</p>
<div class="org-src-container">
<pre class="src src-sh">      dd <span style="color: #ff8700;">if</span>=os.img | ssh root@192.168.58.2 dd <span style="color: #ff8700;">of</span>=/dev/sda
</pre>
</div></li>
</ul>

<p>
安装时虚拟机的磁盘别选太大，这样使用dd安装时就不会太久。然后把磁盘选
为lvm。通过这种方式安装好后又可以扩展。
</p>
</div>
</div>

<div id="outline-container-org40c466d" class="outline-2">
<h2 id="org40c466d"><span class="section-number-2">8</span> MISC</h2>
<div class="outline-text-2" id="text-8">
<p>
dd命令执行经常需要较长时间。急性子们可以这样查询当前进度：
</p>

<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#27604;&#22914;&#65306;&#27599;5&#31186;&#36755;&#20986;dd&#30340;&#36827;&#24230;</span>
    watch -n 5 pkill -USR1 ^dd$
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara">不同系统的mbr.bin位置可能有差异，有的可能还需要先安装syslinux。</div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara">win10也可以这样制作，XP没试过。</div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara">其实备份磁盘更加准确一些。</div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: pengpengxp</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>